posts/2015-08-11-org-lint.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Use org-lint to clean your org-mode files</h2>
<div class="outline-text-2" id="text-1">
<p>
I organize my tasks with Emacs <a href="http://orgmode.org/">org-mode.</a>
As a side project, I have been working on parsing my org files to perform analytics.
It would be possible to do this in Emacs lisp, but I would like to have flexibility to do this in <a href="https://github.com/digitalmentat/orgmode-parse/issues/13">Haskell</a> or R.
As part of this, I want to make sure that the my org-files are properly formatted.
</p>

<p>
To do this, you can use <a href="http://thread.gmane.org/gmane.emacs.orgmode/96989">org-lint</a>.
To get this running, you need to:
</p>

<ol class="org-ol">
<li>Clone the org-mode git repository
</li>
<li>Switch to the <code>wp-lint</code> branch
</li>
<li>Build org-mode
</li>
<li>Start Emacs using this branch
</li>
<li>Open a <code>.org</code> file and use <code>M-x org-lint</code> to fix
</li>
</ol>


<p>
To do this:
</p>

<div class="org-src-container">

<pre class="src src-sh" id="shell-cmds">mkdir -p ~/emacs-dev
<span style="color: #006FE0;">cd</span> ~/emacs-dev
git clone orgmode@orgmode.org:org-mode.git
git checkout wp-lint
<span style="color: #006FE0;">cd</span> org-mode
make
emacs -Q -L lisp/
</pre>
</div>
</div>
</div>
